results/memcached/baseline-throughput/19/nsl201.0.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     1981862 ops,   67358 (avg:   66061) ops/sec, 2.54MB/sec (avg: 2.49MB/sec),  0.56 (avg:  0.57) msec latency

2         Threads
19        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        5812.46          ---          ---      0.57600       430.86
Gets       58118.29     15081.06     43037.22      0.57100      2037.94
Totals     63930.74     15081.06     43037.22      0.57200      2468.80


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     99.99612
SET       2.000    100.00000
---
GET       0.094      0.00006
GET       0.099      0.00011
GET       0.100      0.00017
GET       0.110      0.00033
GET       0.120      0.00061
GET       0.130      0.00133
GET       0.140      0.00333
GET       0.150      0.00777
GET       0.160      0.01710
GET       0.170      0.03974
GET       0.180      0.07809
GET       0.190      0.15203
GET       0.200      0.27974
GET       0.210      0.48505
GET       0.220      0.81929
GET       0.230      1.32305
GET       0.240      2.07501
GET       0.250      3.07897
GET       0.260      4.28723
GET       0.270      5.67822
GET       0.280      7.20391
GET       0.290      8.81752
GET       0.300     10.30963
GET       0.310     11.55258
GET       0.320     12.55265
GET       0.330     13.32477
GET       0.340     13.90184
GET       0.350     14.34337
GET       0.360     14.70226
GET       0.370     15.05460
GET       0.380     15.45207
GET       0.390     15.97974
GET       0.400     16.68603
GET       0.410     17.61899
GET       0.420     18.85046
GET       0.430     20.41356
GET       0.440     22.40354
GET       0.450     24.76412
GET       0.460     27.43458
GET       0.470     30.39222
GET       0.480     33.70070
GET       0.490     37.29901
GET       0.500     41.04364
GET       0.510     44.86586
GET       0.520     48.79848
GET       0.530     52.86630
GET       0.540     56.98675
GET       0.550     60.98131
GET       0.560     64.73465
GET       0.570     68.19637
GET       0.580     71.30060
GET       0.590     73.98171
GET       0.600     76.13598
GET       0.610     77.82608
GET       0.620     79.11782
GET       0.630     80.07981
GET       0.640     80.77750
GET       0.650     81.27964
GET       0.660     81.62893
GET       0.670     81.87476
GET       0.680     82.05109
GET       0.690     82.18425
GET       0.700     82.28865
GET       0.710     82.37368
GET       0.720     82.44711
GET       0.730     82.51755
GET       0.740     82.58854
GET       0.750     82.66341
GET       0.760     82.73779
GET       0.770     82.82054
GET       0.780     82.91379
GET       0.790     83.02568
GET       0.800     83.15784
GET       0.810     83.31841
GET       0.820     83.50857
GET       0.830     83.74279
GET       0.840     84.01998
GET       0.850     84.35367
GET       0.860     84.73615
GET       0.870     85.16791
GET       0.880     85.66095
GET       0.890     86.19118
GET       0.900     86.76071
GET       0.910     87.37064
GET       0.920     88.01682
GET       0.930     88.65761
GET       0.940     89.30018
GET       0.950     89.93220
GET       0.960     90.53531
GET       0.970     91.12781
GET       0.980     91.70161
GET       0.990     92.22440
GET       1.000     94.78569
GET       1.100     98.37168
GET       1.200     99.43047
GET       1.300     99.53255
GET       1.400     99.54997
GET       1.500     99.55897
GET       1.600     99.61486
GET       1.700     99.78670
GET       1.800     99.94433
GET       1.900     99.99123
GET       2.000     99.99906
GET       2.100    100.00000